000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/РаспоряжениеНаПриемку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспоряжениеНаПриемку</name>
  <registerRecords>InformationRegister.РекламныеМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКПриемке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиРекламныхМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаКВМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Количество) КАК Количество,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Сумма) КАК Сумма,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Цена КАК Цена,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаС КАК ДатаС,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаПо КАК ДатаПо,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка КАК РаспоряжениеНаПриемку
	|ИЗ
	|	Документ.РаспоряжениеНаПриемку.РекламныеМатериалы КАК РаспоряжениеНаПриемкуРекламныеМатериалы
	|ГДЕ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Цена,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаС,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаПо,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Количество) КАК Количество,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка КАК ДокументРаспоряжение,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.РаспоряжениеНаПриемку.РекламныеМатериалы КАК РаспоряжениеНаПриемкуРекламныеМатериалы
	|ГДЕ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка = &ДокументСсылка
	|	И РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.НеТребуетПриемки = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Дата"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалы", Результаты[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалыКПриемке", Результаты[1].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
